of_seminar_flappingFoil/flappingFoil/backAndCompGrid/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


libs            (overset fvMotionSolvers); //!! FILL HERE !! //

application     moveDynamicMesh;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          0.01;

writeControl    adjustableRunTime;
writeInterval   0.1; 

purgeWrite      0; 

writeFormat     ascii;

writePrecision  9;

writeCompression off;

timeFormat      general;

timePrecision   4;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           1;

functions
{ 
}



// ************************************************************************* //
